In [1]:
import numpy as np 
import pandas as pd

In [2]:
# Creating Data Table
datadict ={
    "Productname":[],
    "price":[],
    "quantity":[],
    "sale":[],
    "profit":[],

}

blanktable = pd.DataFrame(datadict)

In [3]:
blanktable

Empty DataFrame
Columns: [Productname, price, quantity, sale, profit]
Index: []

In [6]:
appdata= {'name': ['facebook',
  'Instagram',
  'Clash of Clans',
  'Fruit Ninja Classic',
  'Minecraft: Pocket Edition'],
 'currency': ['USD', 'USD', 'USD', 'USD', 'USD'],
 'price': [0.0, 0.0, 0.0, 1.99, 6.99],
 'rating_count': [2974676, 2161558, 2130805, 698516, 522012],
 'user_rating': [3.5, 4.5, 4.5, 4.5, 4.5]}

App_data = pd.DataFrame(appdata)

In [7]:
App_data

                        name currency  price  rating_count  user_rating
0                   facebook      USD   0.00       2974676          3.5
1                  Instagram      USD   0.00       2161558          4.5
2             Clash of Clans      USD   0.00       2130805          4.5
3        Fruit Ninja Classic      USD   1.99        698516          4.5
4  Minecraft: Pocket Edition      USD   6.99        522012          4.5

In [8]:
# select * from app_data 
App_data

                        name currency  price  rating_count  user_rating
0                   facebook      USD   0.00       2974676          3.5
1                  Instagram      USD   0.00       2161558          4.5
2             Clash of Clans      USD   0.00       2130805          4.5
3        Fruit Ninja Classic      USD   1.99        698516          4.5
4  Minecraft: Pocket Edition      USD   6.99        522012          4.5

In [9]:
# select name from app_data
App_data["name"]

0                     facebook
1                    Instagram
2               Clash of Clans
3          Fruit Ninja Classic
4    Minecraft: Pocket Edition
Name: name, dtype: object

In [10]:
# select name,user_rating from app_data
App_data[["name","user_rating"]]

                        name  user_rating
0                   facebook          3.5
1                  Instagram          4.5
2             Clash of Clans          4.5
3        Fruit Ninja Classic          4.5
4  Minecraft: Pocket Edition          4.5

In [11]:
# select name,user_rating,price from app_data
App_data[["name","user_rating","price"]]

                        name  user_rating  price
0                   facebook          3.5   0.00
1                  Instagram          4.5   0.00
2             Clash of Clans          4.5   0.00
3        Fruit Ninja Classic          4.5   1.99
4  Minecraft: Pocket Edition          4.5   6.99

In [12]:
# select distinct(user_rating) from app_data
App_data["user_rating"].unique()

array([3.5, 4.5])

In [13]:
# select max(rating_count) from app_data
App_data["rating_count"].max()

2974676

In [14]:
# select min(rating_count) from app_data
App_data["rating_count"].min()

522012

In [15]:
# select avg(rating_count) from app_data
App_data["rating_count"].mean()

1697513.4

In [16]:
App_data["rating_count"].median()

2130805.0

In [17]:
%pip install scipy

Requirement already satisfied: scipy in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (1.13.0)
Requirement already satisfied: numpy<2.3,>=1.22.4 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from scipy) (1.26.4)

[notice] A new release of pip is available: 23.2.1 -> 25.0
[notice] To update, run: python3 -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [18]:
from scipy import stats as st
st.mode(App_data["user_rating"])

ModeResult(mode=4.5, count=4)

In [19]:
# select count(*) from app_data
len(App_data)

5

In [22]:
#select count(distinct(user_rating)) from app_data
len(App_data["user_rating"].unique())

2

In [23]:
# select std_div(user_rating) from app_data
App_data["user_rating"].std()

0.44721359549995787

In [26]:
App_data["currency"].unique()

array(['USD'], dtype=object)

In [27]:
App_data["name"].sort_values()

2               Clash of Clans
3          Fruit Ninja Classic
1                    Instagram
4    Minecraft: Pocket Edition
0                     facebook
Name: name, dtype: object

In [28]:
App_data["rating_count"].sort_values()

4     522012
3     698516
2    2130805
1    2161558
0    2974676
Name: rating_count, dtype: int64

In [29]:
# select job_name,count(emp_name) from employees groub by job_name
employees = [
    {"emp_id": 68319, "emp_name": "KAYLING", "job_name": "PRESIDENT", "manager_id": None, "hire_date": "1991-11-18", "salary": 6000.00, "commission": None, "dep_id": 1001},
    {"emp_id": 66928, "emp_name": "BLAZE", "job_name": "MANAGER", "manager_id": 68319, "hire_date": "1991-05-01", "salary": 2750.00, "commission": None, "dep_id": 3001},
    {"emp_id": 67832, "emp_name": "CLARE", "job_name": "MANAGER", "manager_id": 68319, "hire_date": "1991-06-09", "salary": 2550.00, "commission": None, "dep_id": 1001},
    {"emp_id": 65646, "emp_name": "JONAS", "job_name": "MANAGER", "manager_id": 68319, "hire_date": "1991-04-02", "salary": 2957.00, "commission": None, "dep_id": 2001},
    {"emp_id": 67858, "emp_name": "SCARLET", "job_name": "ANALYST", "manager_id": 65646, "hire_date": "1997-04-19", "salary": 3100.00, "commission": None, "dep_id": 2001},
    {"emp_id": 69062, "emp_name": "FRANK", "job_name": "ANALYST", "manager_id": 65646, "hire_date": "1991-12-03", "salary": 3100.00, "commission": None, "dep_id": 2001},
    {"emp_id": 63679, "emp_name": "SANDRINE", "job_name": "CLERK", "manager_id": 69062, "hire_date": "1990-12-18", "salary": 900.00, "commission": None, "dep_id": 2001},
    {"emp_id": 64989, "emp_name": "ADELYN", "job_name": "SALESMAN", "manager_id": 66928, "hire_date": "1991-02-20", "salary": 1700.00, "commission": 400.00, "dep_id": 3001},
    {"emp_id": 65271, "emp_name": "WADE", "job_name": "SALESMAN", "manager_id": 66928, "hire_date": "1991-02-22", "salary": 1350.00, "commission": 600.00, "dep_id": 3001},
    {"emp_id": 66564, "emp_name": "MADDEN", "job_name": "SALESMAN", "manager_id": 66928, "hire_date": "1991-09-28", "salary": 1350.00, "commission": 1500.00, "dep_id": 3001},
    {"emp_id": 68454, "emp_name": "TUCKER", "job_name": "SALESMAN", "manager_id": 66928, "hire_date": "1991-09-08", "salary": 1600.00, "commission": 0.00, "dep_id": 3001},
    {"emp_id": 68736, "emp_name": "ADNRES", "job_name": "CLERK", "manager_id": 67858, "hire_date": "1997-05-23", "salary": 1200.00, "commission": None, "dep_id": 2001},
    {"emp_id": 69000, "emp_name": "JULIUS", "job_name": "CLERK", "manager_id": 66928, "hire_date": "1991-12-03", "salary": 1050.00, "commission": None, "dep_id": 3001},
    {"emp_id": 69324, "emp_name": "MARKER", "job_name": "CLERK", "manager_id": 67832, "hire_date": "1992-01-23", "salary": 1400.00, "commission": None, "dep_id": 1001}
]

# Converting to DataFrame
df = pd.DataFrame(employees)

In [30]:
df

,emp_id,emp_name,job_name,manager_id,hire_date,salary,commission,dep_id
0,68319,KAYLING,PRESIDENT,NaN,1991-11-18,6000.0,NaN,1001
1,66928,BLAZE,MANAGER,68319.0,1991-05-01,2750.0,NaN,3001
2,67832,CLARE,MANAGER,68319.0,1991-06-09,2550.0,NaN,1001
3,65646,JONAS,MANAGER,68319.0,1991-04-02,2957.0,NaN,2001
4,67858,SCARLET,ANALYST,65646.0,1997-04-19,3100.0,NaN,2001
5,69062,FRANK,ANALYST,65646.0,1991-12-03,3100.0,NaN,2001
6,63679,SANDRINE,CLERK,69062.0,1990-12-18,900.0,NaN,2001
7,64989,ADELYN,SALESMAN,66928.0,1991-02-20,1700.0,400.0,3001
8,65271,WADE,SALESMAN,66928.0,1991-02-22,1350.0,600.0,3001
9,66564,MADDEN,SALESMAN,66928.0,1991-09-28,1350.0,1500.0,3001
10,68454,TUCKER,SALESMAN,66928.0,1991-09-08,1600.0,0.0,3001
11,68736,ADNRES,CLERK,67858.0,1997-05-23,1200.0,NaN,2001
12,69000,JULIUS,CLERK,66928.0,1991-12-03,1050.0,NaN,3001
13,69324,MARKER,CLERK,67832.0,1992-01-23,1400.0,NaN,1001